app/Controllers/ProductController.php

    public function index()
    {

        $data['title'] = "Miguelito's Grocery Store";

        $model = model('ProductModel');
        // $data['products'] = $model->findAll();
        $data['products'] = $model->get()->getResultArray();
---
SELECT *
FROM `products`